Revit 2026 API

# RebarConstraintGetTargetRebarAngleOnBarOrHookBend Method

---

Returns the angular increment along a bar or hook bend to which the RebarConstraint is attached.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int GetTargetRebarAngleOnBarOrHookBend()
```
```vb
Public Function GetTargetRebarAngleOnBarOrHookBend As Integer
```
```cpp
public:
int GetTargetRebarAngleOnBarOrHookBend()
```
```fsharp
member GetTargetRebarAngleOnBarOrHookBend : unit -> int
```

#### Return Value

Int32 The angular increment relative to the reference bar edge.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar'. -or- The RebarTargetConstraintType is not 'HookBend' or 'BarBend'. -or- Constrained rebar isn't a shape driven rebar element. |

Only applies to RebarConstraints with TargetRebarConstraintType BarBend or HookBend. For HookBends, values can be 0, 1, 2, 3 or 4, representing angular locations of 0, 45, 90, 135, and 180 degrees around the hook, starting at the 'base' of the hook (or end of the bar without hook). For interior BarBends, values can 0 or 1, where 0 means at the intersection of the bar bend and the edge specified by getTargetRebarEdgeNumber, and 1 means the mid-point of the bend arc. Rebar must be Shape Driven Rebar element.

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace